In [144]:
import pandas as pd

df = pd.read_csv('lego_sets.csv')
theme = pd.read_csv('parent_themes.csv')

# ?איזה אחוז מכל הסטים המורשים שיצאו אי פעם היו של מלחמת הכוכבים

In [145]:
theme.head(5)

    id     name  is_licensed
0    1  Technic        False
1   22  Creator        False
2   50     Town        False
3  112   Racers        False
4  126    Space        False

In [146]:
theme.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111 entries, 0 to 110
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           111 non-null    int64
 1   name         111 non-null    object
 2   is_licensed  111 non-null    bool
dtypes: bool(1), int64(1), object(1)
memory usage: 2.0+ KB

In [147]:
df.head(5)

,set_num,name,year,num_parts,theme_name,parent_theme
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland
1,0011-2,Town Mini-Figures,1978,NaN,Supplemental,Town
2,0011-3,Castle 2 for 1 Bonus Offer,1987,NaN,Lion Knights,Castle
3,0012-1,Space Mini-Figures,1979,12.0,Supplemental,Space
4,0013-1,Space Mini-Figures,1979,12.0,Supplemental,Space

In [148]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11986 entries, 0 to 11985
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   set_num       11833 non-null  object
 1   name          11833 non-null  object
 2   year          11986 non-null  int64
 3   num_parts     6926 non-null   float64
 4   theme_name    11833 non-null  object
 5   parent_theme  11986 non-null  object
dtypes: float64(1), int64(1), object(4)
memory usage: 562.0+ KB

In [149]:
join = df.merge(theme,left_on="parent_theme",right_on="name")

join.drop(columns=["name_y"],inplace=True)

join.dropna(subset = ["set_num"],inplace = True)

join.head(5)

,set_num,name_x,year,num_parts,theme_name,parent_theme,id,is_licensed
0,00-1,Weetabix Castle,1970,471.0,Castle,Legoland,411,False
1,00-2,Weetabix Promotional House 1,1976,NaN,Building,Legoland,411,False
2,00-3,Weetabix Promotional House 2,1976,NaN,Building,Legoland,411,False
3,00-4,Weetabix Promotional Windmill,1976,126.0,Building,Legoland,411,False
4,00-7,Weetabix Promotional Lego Village,1976,NaN,Building,Legoland,411,False

In [150]:
join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11833 entries, 0 to 11985
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   set_num       11833 non-null  object
 1   name_x        11833 non-null  object
 2   year          11833 non-null  int64
 3   num_parts     6835 non-null   float64
 4   theme_name    11833 non-null  object
 5   parent_theme  11833 non-null  object
 6   id            11833 non-null  int64
 7   is_licensed   11833 non-null  bool
dtypes: bool(1), float64(1), int64(2), object(4)
memory usage: 751.1+ KB

In [151]:
licenseDF = join[join["is_licensed"] == True]

denominator = licenseDF.shape[0]

StarWars = licenseDF[licenseDF["parent_theme"] == "Star Wars"]

numerator = StarWars.shape[0]

print("answer :" + str(round(numerator/denominator*100)) + "%")

answer :52%

In [152]:
# ?באיזו שנה יצאו לאור הכי הרבה סטים שונים של לגו
selectDF = df[["name","year"]]

selectDF.head(5)

                         name  year
0             Weetabix Castle  1970
1           Town Mini-Figures  1978
2  Castle 2 for 1 Bonus Offer  1987
3          Space Mini-Figures  1979
4          Space Mini-Figures  1979

In [153]:
selectDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11986 entries, 0 to 11985
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    11833 non-null  object
 1   year    11986 non-null  int64
dtypes: int64(1), object(1)
memory usage: 187.4+ KB

In [157]:
selectDF.drop_duplicates(inplace=True)

selectDF.dropna(inplace = True)

groupDF = selectDF.groupby('year').count().reset_index()

groupDF

/Library/Frameworks/Python.framework/Versions/3.8/lib/python3.8/site-packages/pandas/util/_decorators.py:311: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return func(*args, **kwargs)

    year  name
0   1950     7
1   1953     4
2   1954    13
3   1955    27
4   1956    12
..   ...   ...
61  2013   591
62  2014   711
63  2015   662
64  2016   605
65  2017   432

[66 rows x 2 columns]

In [159]:
maxi = groupDF["name"].max()

groupDF[groupDF["name"] == maxi]

    year  name
62  2014   711